SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( F59PHI_455
	comment ( Surfliner Amtrak F59PHI )
	comment ( PLEASE NOTE: The physics settings within this file are based on matching the simulator's performance to the performance of the prototype. The end result is highly accurate acceleration and deceleration, regardless of the engine's true 'specs' in the EMD documentation. )
      Type ( Engine )
	WagonShape ( F59PHI_455.s )
	Size ( 3.1m 4.768m 17.6m )
	comment( 268,000 lbs )
	Mass ( 119.0t )
	WheelRadius ( 20in )
	InertiaTensor ( Box (3.1m 4.431m 17.6m) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1.2e6N/m/s 1.2e6N/m/s )
			Break ( 1.6e7N 1.6e7N )
			r0 ( 20cm 30cm )
		)
		CouplingHasRigidConnection ()
		Velocity ( 0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1.2e6N/m/s 1.2e6N/m/s )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)
	
	Adheasion ( 0.24 0.46 1.8 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*177.0t )
	DerailBufferForce ( 385kN )
	NumWheels (	8 )
	Friction (
	1895N/m/s		0		.7mph		   19.76N/m/s	1.8
	5.1N/rad/s		1		-1rad/s		0		1
	)

      AntiSlip ( 0 )
	
	BrakeEquipmentType( "Auxilary_reservoir, Graduated_release_triple_valve, Emergency_brake_reservoir, Handbrake" )

	BrakeSystemType( "Air_single_pipe" )
	MaxBrakeForce( 83kN )

	EmergencyBrakeResMaxPressure( 110 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 7 )
	MaxApplicationRate( 5.5 )
	MaxAuxilaryChargingRate( 2 )
	EmergencyResCapacity( 11 )
	EmergencyResChargingRate( 2.8 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 66 )

	Lights	(	21
		Light	(
			comment( Light Sphere Dim )
			Type		( 1 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 1.5 4.0 )
					Transition ( 0 )
					Radius ( 150.0 )
					Angle ( 15.0 )
					)
				)
			)
		Light	(
			comment( Light Sphere Bright )
			Type		( 1 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 1.5 4.0 )
					Transition ( 0 )
					Radius ( 150.0 )
					Angle ( 15.0 )
					)
				)
			)
		Light	(
			comment( Light Sphere Flash )
			Type		( 1 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	2
				State	(
					Duration ( 0.6 )
					LightColour ( ffffffff )
					Position ( 3.0 1.5 4.0 )
					Transition ( 1.0 )
					Radius ( 200.0 )
					Angle ( 15.0 )
					)
                        State	(
					Duration ( 0.6 )
					LightColour ( ffffffff )
					Position ( -3.0 3.0 8.0 )
					Transition ( 1.0 )
					Radius ( 200.0 )
					Angle ( 15.0 )
					)
				)
			)
		Light	(
			comment( Front Marker )
			Type		( 0 )
			Conditions	(
				Headlight ( 1 )
				Unit ( 2 )
				Control ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( a0ff0000 )
					Position ( 0.5954 1.8826 8.62 )
					Azimuth ( 10 10 10 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Small Light Dim Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( -0.1 3.0163 8.01 )
					Elevation ( 0 -45.5 -45.5 # Thanks Jack )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Small Light Dim Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.1 3.0163 8.02 )
					Elevation ( 0 -45.5 -45.5 # Thanks Jack )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Small Light Dim Center )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0 3.0163 8.04 )
					Elevation ( 0 -45.5 -45.5 # Thanks Jack )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Small Light Bright Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( -0.1 3.0163 8.01 )
					Elevation ( 0 -45.5 -45.5 # Thanks Jack )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Small Light Bright Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.1 3.0163 8.02 )
					Elevation ( 0 -45.5 -45.5 # Thanks Jack )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Small Light Bright Center )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0 3.0163 8.04 )
					Elevation ( 0 -45.5 -45.5 # Thanks Jack )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		Light	(
			comment( Head Flasher Light Bright Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( -0.9405 1.8826 8.439 )
					Azimuth ( -31 -31 -31 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Head Flasher Light Bright Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.9405 1.8826 8.439 )
					Azimuth ( 31 31 31 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
comment (----------------------------------------------------------------------------------)
		Light	(
			comment( Flashing Light Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			States	(	2
				State	(
					Duration ( 0.6 )
					LightColour ( 00000000 )
					Position ( -0.9405 1.8826 8.439 )
					Azimuth ( -31 -31 -31 )
					Transition ( 1.0 )
					Radius ( 0.5 )
					)
				State	(
					Duration ( 0.6 )
					LightColour ( ffffffff )
					Position ( -0.9405 1.8826 8.439 )
					Azimuth ( -31 -31 -31 )
					Transition ( 1.0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Flashing Light Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				Control ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			States	(	2
				State	(
					Duration ( 0.6 )
					LightColour ( ffffffff )
					Position ( 0.9405 1.8826 8.439 )
					Azimuth ( 31 31 31 )
					Transition ( 1.0 )
					Radius ( 0.5 )
					)
				State	(
					Duration ( 0.6 )
					LightColour ( 00000000 )
					Position ( 0.9405 1.8826 8.439 )
					Azimuth ( 31 31 31 )
					Transition ( 1.0 )
					Radius ( 0.5 )
					)
				)
			)
comment (----------------------------------------------------------------------------------)
		Light	(
			comment( Step Light Left Front )
			Type		( 0 )
			Conditions	(
				Unit ( 0 )
				Control ( 0 )
				TimeOfDay ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef2d15e )
					Position ( -1.4618 1.2 4.9293 )
					Azimuth ( -80 -90 -100 )
					Transition ( 0 )
					Radius ( 0.2 )
					)
				)
			)
		Light	(
			comment( Step Light Left Rear )
			Type		( 0 )
			Conditions	(
				Unit ( 0 )
				Control ( 0 )
				TimeOfDay ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef2d15e )
					Position ( -1.4618 1.45 -7.926 )
					Azimuth ( -80 -90 -100 )
					Transition ( 0 )
					Radius ( 0.2 )
					)
				)
			)
		Light	(
			comment( Step Light Right Front )
			Type		( 0 )
			Conditions	(
				Unit ( 0 )
				Control ( 0 )
				TimeOfDay ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef2d15e )
					Position ( 1.4618 1.2 4.9293 )
					Azimuth ( 80 100 90 )
					Transition ( 0 )
					Radius ( 0.2 )
					)
				)
			)
		Light	(
			comment( Step Light Right Rear )
			Type		( 0 )
			Conditions	(
				Unit ( 0 )
				Control ( 0 )
				TimeOfDay ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef2d15e )
					Position ( 1.4618 1.45 -7.926 )
					Azimuth ( 80 100 90 )
					Transition ( 0 )
					Radius ( 0.2 )
					)
				)
			)
comment (----------------------------------------------------------------------------------)
		Light	(
			comment( Front Facing Marker )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 3 )
                        Penalty ( 0 )
				Control ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( a0ff0000 )
					Position ( 0.5953 1.8824 8.62 )
					Azimuth ( 8 8 8 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Penalty Marker Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 2 )
                        Penalty ( 2 )
				Control ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( a0ff0000 )
					Position ( 0.5954 1.8826 8.62 )
					Azimuth ( 10 10 10 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Penalty Marker Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 2 )
                        Penalty ( 2 )
				Control ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			States	(	2
				State	(
					Duration ( 0.1 )
					LightColour ( a0ff0000 )
					Position ( -0.5953 1.8824 8.61 )
					Azimuth ( -8 -8 -8 )
					Transition ( 1.0 )
					Radius ( 0.4 )
					)
				State	(
					Duration ( 0.6 )
					LightColour ( 00000000 )
					Position ( -0.5953 1.8824 8.61 )
					Azimuth ( -8 -8 -8 )
					Transition ( 1.0 )
					Radius ( 0.65 )
					)
				)
			)
		)

    	Sound ( "../../Surfliner_Common/Sound/Surfliner_F59PHIEng.sms" )

)

Engine ( F59PHI_455
	Effects
	(
		DieselSpecialEffects
		(
			_skip
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			Exhaust1
			(
                                0.00 4.57 1.56
				0 1 0
				0.19
			)
		)
        )
        
	Wagon ( F59PHI_455 )
	Type ( Diesel )
	MaxPower ( 2238kW )
	MaxForce ( 367.5kN )
	MaxContinuousForce ( 302.6kN )
	MaxVelocity ( 93mph )
	MaxCurrent ( 1070A )
	WheelRadius ( 20in )

	Sanding ( 15mph #sanding system is switched off when faster than given velocity )

	NumWheels ( 4 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	CabView ( "F59PHI_455.cvf" )
	HeadOut ( 1.7 3.4 5.7 )
      MaxDieselLevel ( 1800gal )
	DieselUsedPerHourAtMaxPower ( 164.4gal )
	DieselUsedPerHourAtIdle ( 5.2gal )

	AirBrakesAirCompressorPowerRating( 4 )
	AirBrakesMainMinResAirPressure( 14.7 )
	AirBrakesMainMaxAirPressure( 140 )
	AirBrakesMainResVolume( 11 )
	AirBrakesAirCompressorWattage( 19000 )
	AirBrakesCompressorRestartPressure( 135 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 1.4 )
	AirBrakesHasLowPressureTest( 0 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )

	EngineBrakesControllerMinPressureReduction( 7 )
	TrainBrakesControllerMinPressureReduction( 7 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.6 )
	EngineBrakesControllerMaxApplicationRate( 7 )
	TrainBrakesControllerMaxApplicationRate( 5.5 )
	EngineBrakesControllerMaxReleaseRate( 14 )
	TrainBrakesControllerMaxReleaseRate( 3.4 )
	EngineBrakesControllerEmergencyApplicationRate( 8 )
	TrainBrakesControllerEmergencyApplicationRate( 7 )
	EngineBrakesControllerMinSystemPressure( 20 )
	TrainBrakesControllerMinSystemPressure( 20 )
	EngineBrakesControllerMaxSystemPressure( 110 )
	TrainBrakesControllerMaxSystemPressure( 110 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )

	DynamicBrakesMinUsableSpeed( 3.5 )
	DynamicBrakesMaximumEffectiveSpeed( 90 )
	DynamicBrakesMaximumForce( 100kN )
	DynamicBrakesResistorCurrentLimit ( 760 )
	DynamicBrakesCutInSpeed( 5.5 )
	DynamicBrakesMaxAirBrakePressure ( 50 )
	DynamicBrakesFadingSpeed( 8 )
	DynamicBrakesDelayTimeBeforeEngaging ( 3 )
	DynamicBrakesMaximumSpeedForFadeOut ( 450 )
	DynamicBrakesEffectAtMaximumFadeOut( 0 )
	DynamicBrakesHigherSpeedCurveExponent( 10.2 )
	DynamicBrakesLowerSpeedCurveExponent( 0.9 )
	DynamicBrakesNumberOfControllerNotches( 1 )
      DynamicBrakeHasAutoBailOff ( 1 )

	BrakesEngineBrakeType( "Air_single_pipe"  )
	BrakesTrainBrakeType( "Air_single_pipe" )
      BrakesEngineControllers( "Independent, Train, Dynamic" )

	MaxDieselLevel ( 1800gal )
	DieselUsedPerHourAtMaxPower ( 170.0gal )
	DieselUsedPerHourAtIdle ( 4.8gal )

	DieselSmokeEffectInitialMagnitude( 1.2 )
	DieselSmokeEffectMaxMagnitude( 1.8 )
	DieselSmokeEffectInitialSmokeRate( 0.4 )
	DieselSmokeEffectMaxSmokeRate( 3.1 )

	DieselEngineIdleRPM( 200 )
	DieselEngineMaxRPM( 900 )
	DieselEngineSpeedOfMaxTractiveEffort( 11.1mph )
      DieselEngineMaxRPMChangeRate( 25 )
      DoesHornTriggerBell ( 1 )
  
 	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)
		
	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 110 )
		MonitoringDeviceAlarmTimeLimit( 70 )
		MonitoringDevicePenaltyTimeLimit( 10 )
		MonitoringDeviceCriticalLevel( 30 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceResetOnZeroSpeed( 1 )
		)

	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 92.6 )
		MonitoringDeviceResetLevel( 0.1 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceAlarmTimeBeforeOverSpeed( 1.5 )
		MonitoringDeviceDoesSuppressionReset( 0 )
		MonitoringDeviceTriggerOnOverspeed( 93.8 )
		MonitoringDeviceResetOnZeroSpeed( 0 )
		MonitoringDeviceResetOnResetButton( 1 )
		)

	EngineBrakesControllerDirectControlExponent( 1 )

	EngineControllers (
		Throttle ( 0 1 0.125 0 
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.06   0 Dummy )
                    Notch ( 0.12    0 Dummy )
                    Notch ( 0.22   0 Dummy )
                    Notch ( 0.33    0 Dummy )
                    Notch ( 0.44   0 Dummy )
                    Notch ( 0.53    0 Dummy )
                    Notch ( 0.80   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
		Brake_Engine ( 0 1 0.0250 0.66 
			NumNotches ( 1
				Notch( 0		1 Dummy )
			)
		)
		Brake_Train ( 0 1 0.0125 0.44
			NumNotches ( 5
				Notch( 0		0 TrainBrakesControllerReleaseStart )
				Notch( 0.3		1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
				Notch( 0.85		0 TrainBrakesControllerSuppressionStart )
				Notch( 0.9		0 TrainBrakesControllerContinuousServiceStart )
				Notch( 0.95		0 TrainBrakesControllerEmergencyStart )
			)
		)
		Brake_Dynamic ( 0 1 0.0125 0 
                NumNotches ( 3
                    Notch ( 0       0 Dummy )
                    Notch ( 0.0125  1 Dummy )
                    Notch ( 0.0126  1 Dummy )
                 )
            )
		Combined_Control( 0 1 0.5 0.5 throttle dynamic )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
		BailOffButton ( 0 1 0 )
        )
    	Sound ( "../../Surfliner_Common/Sound/Surfliner_F59PHICab.sms" )
	Name ( "Surfliner F59PHI: #455" )
 	Description (
	"XXXXXXXXXXXXXXXXXXXXXXXXXX\n"+
	"AMTRAK EQUIP DATA SHEET\n"+
	"XXXXXXXXXXXXXXXXXXXXXXXXXX\n"+
	"--------------------------\n"+
	"EMD F59PHI LOCOMOTIVE #455\n"+
	"--------------------------\n"+
	"EQUIPMENT SPECIFICATIONS\n"+
	"ENGINE: 12N-710-G3B-EC\n"+
	"TYPE:   Turbocharged\n"+
	"NUMBER OF CYLINDERS: 12\n"+
	"HORSEPOWER:  3000\n"+
	"WHEEL ARRANGEMENT: B-B\n"+
	"--------------------------\n"+
	"PERFORMANCE\n"+
	"TOP SPEED:  110 MPH\n"+
	"MAX AUTH SPEED:  90 MPH\n"+
	"OVERSPEED PENALTY: 93 MPH\n"+
	"--------------------------\n"+
	"DIMENSIONAL SPECIFICATIONS\n"+
	"LENGTH: 58Ft. 2In.\n"+
	"WIDTH:  10Ft. 6.5In.\n"+
	"HEIGHT:  15Ft. 11.5In.\n"+
	"\n\n"+
	"LOADED WEIGHT ON RAIL:\n"+
	"               268,000 Lbs.\n"+
	"--------------------------\n"+
	"--------------------------\n"+
	"3D Models: Marc Nelson\n"+
	"Audio Eng: Dan Zollner\n"+
	"Performance: Andrew Held\n"+
	"\n\n"+
	"Copyright 2003\n"+
	"Facing Point Media 2003"
 	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+  
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1.	Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"4.	Release the brakes.\n"+
	"5.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
	) 

)
